adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/_ipdlheaders/mozilla/net/PSocketProcessChild.h
public:
    typedef MozPromise<bool, ResponseRejectReason, true> CachePushCheckPromise;
    typedef std::function<void(const uint32_t&)> RequestMemoryReportResolver;
    typedef std::function<void(const SocketDataArgs&)> GetSocketDataResolver;
    typedef std::function<void(nsTArray<DNSCacheEntries>&&)> GetDNSCacheEntriesResolver;
    typedef std::function<void(nsTArray<HttpRetParams>&&)> GetHttpConnectionDataResolver;

protected:
    virtual mozilla::ipc::IPCResult
    RecvPHttpTransactionConstructor(PHttpTransactionChild* actor);
    virtual mozilla::ipc::IPCResult
    RecvPParentToChildStreamConstructor(PParentToChildStreamChild* actor);
    virtual mozilla::ipc::IPCResult
    RecvPHttpConnectionMgrConstructor(
            PHttpConnectionMgrChild* actor,
            const HttpHandlerInitArgs& aArgs);
    virtual mozilla::ipc::IPCResult
    RecvPInputChannelThrottleQueueConstructor(
            PInputChannelThrottleQueueChild* actor,
            const uint32_t& meanBytesPerSecond,
            const uint32_t& maxBytesPerSecond);
    virtual mozilla::ipc::IPCResult
    RecvPAltSvcTransactionConstructor(
            PAltSvcTransactionChild* actor,
            const HttpConnectionInfoCloneArgs& aConnInfo,
            const uint32_t& aCaps);
    virtual mozilla::ipc::IPCResult
    RecvPTRRServiceConstructor(
            PTRRServiceChild* actor,
            const bool& aCaptiveIsPassed,
            const bool& aParentalControlEnabled,
            nsTArray<nsCString>&& aDNSSuffixList);
    virtual mozilla::ipc::IPCResult
    RecvPNativeDNSResolverOverrideConstructor(PNativeDNSResolverOverrideChild* actor);
    virtual mozilla::ipc::IPCResult
    RecvPRemoteLazyInputStreamConstructor(
            PRemoteLazyInputStreamChild* actor,
            const nsID& aID,
            const uint64_t& aSize);
    virtual mozilla::ipc::IPCResult
    RecvPFileDescriptorSetConstructor(
            PFileDescriptorSetChild* actor,
            const FileDescriptor& fd);
    virtual mozilla::ipc::IPCResult
    RecvPDNSRequestConstructor(
            PDNSRequestChild* actor,
            const nsCString& hostName,
            const nsCString& trrServer,
            const uint16_t& type,
            const OriginAttributes& originAttributes,
            const uint32_t& flags);
    void
    ProcessingError(
            Result aCode,
            const char* aReason) override;
    bool
    ShouldContinueFromReplyTimeout() override;
    void
    EnteredCxxStack() override;
    void
    ExitedCxxStack() override;
    void
    EnteredCall() override;
    void
    ExitedCall() override;

public:
    typedef mozilla::ipc::IProtocol IProtocol;
    typedef IPC::Message Message;
    typedef base::ProcessHandle ProcessHandle;
    typedef mozilla::ipc::MessageChannel MessageChannel;
    typedef mozilla::ipc::SharedMemory SharedMemory;

public:
    MOZ_IMPLICIT PSocketProcessChild();

    virtual ~PSocketProcessChild();

public:
    void
    ManagedPDNSRequestChild(nsTArray<PDNSRequestChild*>& aArr) const;
    const ManagedContainer<PDNSRequestChild>&
    ManagedPDNSRequestChild() const;

    void
    ManagedPWebrtcTCPSocketChild(nsTArray<PWebrtcTCPSocketChild*>& aArr) const;
    const ManagedContainer<PWebrtcTCPSocketChild>&
    ManagedPWebrtcTCPSocketChild() const;

    void
    ManagedPFileDescriptorSetChild(nsTArray<PFileDescriptorSetChild*>& aArr) const;
    const ManagedContainer<PFileDescriptorSetChild>&
    ManagedPFileDescriptorSetChild() const;

    void
    ManagedPHttpTransactionChild(nsTArray<PHttpTransactionChild*>& aArr) const;
    const ManagedContainer<PHttpTransactionChild>&
    ManagedPHttpTransactionChild() const;

    void
    ManagedPHttpConnectionMgrChild(nsTArray<PHttpConnectionMgrChild*>& aArr) const;
    const ManagedContainer<PHttpConnectionMgrChild>&
    ManagedPHttpConnectionMgrChild() const;

    void
    ManagedPChildToParentStreamChild(nsTArray<PChildToParentStreamChild*>& aArr) const;
    const ManagedContainer<PChildToParentStreamChild>&
    ManagedPChildToParentStreamChild() const;

    void
    ManagedPParentToChildStreamChild(nsTArray<PParentToChildStreamChild*>& aArr) const;
    const ManagedContainer<PParentToChildStreamChild>&
    ManagedPParentToChildStreamChild() const;

    void
    ManagedPInputChannelThrottleQueueChild(nsTArray<PInputChannelThrottleQueueChild*>& aArr) const;
    const ManagedContainer<PInputChannelThrottleQueueChild>&
    ManagedPInputChannelThrottleQueueChild() const;

    void
    ManagedPAltServiceChild(nsTArray<PAltServiceChild*>& aArr) const;
    const ManagedContainer<PAltServiceChild>&
    ManagedPAltServiceChild() const;

    void
    ManagedPAltSvcTransactionChild(nsTArray<PAltSvcTransactionChild*>& aArr) const;
    const ManagedContainer<PAltSvcTransactionChild>&
    ManagedPAltSvcTransactionChild() const;

    void
    ManagedPTRRServiceChild(nsTArray<PTRRServiceChild*>& aArr) const;
    const ManagedContainer<PTRRServiceChild>&
    ManagedPTRRServiceChild() const;

    void
    ManagedPProxyConfigLookupChild(nsTArray<PProxyConfigLookupChild*>& aArr) const;
    const ManagedContainer<PProxyConfigLookupChild>&
    ManagedPProxyConfigLookupChild() const;

    void
    ManagedPNativeDNSResolverOverrideChild(nsTArray<PNativeDNSResolverOverrideChild*>& aArr) const;
    const ManagedContainer<PNativeDNSResolverOverrideChild>&
    ManagedPNativeDNSResolverOverrideChild() const;

    void
    ManagedPRemoteLazyInputStreamChild(nsTArray<PRemoteLazyInputStreamChild*>& aArr) const;
    const ManagedContainer<PRemoteLazyInputStreamChild>&
    ManagedPRemoteLazyInputStreamChild() const;

    void
    AllManagedActors(nsTArray<RefPtr<mozilla::ipc::ActorLifecycleProxy>>& arr__) const override;

    ManagedEndpoint<PDNSRequestParent>
    OpenPDNSRequestEndpoint(PDNSRequestChild* aActor);
    bool
    BindPDNSRequestEndpoint(
            ManagedEndpoint<PDNSRequestChild> aEndpoint,
            PDNSRequestChild* aActor);

    ManagedEndpoint<PWebrtcTCPSocketParent>
    OpenPWebrtcTCPSocketEndpoint(PWebrtcTCPSocketChild* aActor);
    bool
    BindPWebrtcTCPSocketEndpoint(
            ManagedEndpoint<PWebrtcTCPSocketChild> aEndpoint,
            PWebrtcTCPSocketChild* aActor);

    ManagedEndpoint<PFileDescriptorSetParent>
    OpenPFileDescriptorSetEndpoint(PFileDescriptorSetChild* aActor);
    bool
    BindPFileDescriptorSetEndpoint(
            ManagedEndpoint<PFileDescriptorSetChild> aEndpoint,
            PFileDescriptorSetChild* aActor);

    ManagedEndpoint<PHttpTransactionParent>
    OpenPHttpTransactionEndpoint(PHttpTransactionChild* aActor);
    bool
    BindPHttpTransactionEndpoint(
            ManagedEndpoint<PHttpTransactionChild> aEndpoint,
            PHttpTransactionChild* aActor);

    ManagedEndpoint<PHttpConnectionMgrParent>
    OpenPHttpConnectionMgrEndpoint(PHttpConnectionMgrChild* aActor);
    bool
    BindPHttpConnectionMgrEndpoint(
            ManagedEndpoint<PHttpConnectionMgrChild> aEndpoint,
            PHttpConnectionMgrChild* aActor);

    ManagedEndpoint<PChildToParentStreamParent>
    OpenPChildToParentStreamEndpoint(PChildToParentStreamChild* aActor);
    bool
    BindPChildToParentStreamEndpoint(
            ManagedEndpoint<PChildToParentStreamChild> aEndpoint,
            PChildToParentStreamChild* aActor);

    ManagedEndpoint<PParentToChildStreamParent>
    OpenPParentToChildStreamEndpoint(PParentToChildStreamChild* aActor);
    bool
    BindPParentToChildStreamEndpoint(
            ManagedEndpoint<PParentToChildStreamChild> aEndpoint,
            PParentToChildStreamChild* aActor);

    ManagedEndpoint<PInputChannelThrottleQueueParent>
    OpenPInputChannelThrottleQueueEndpoint(PInputChannelThrottleQueueChild* aActor);
    bool
    BindPInputChannelThrottleQueueEndpoint(
            ManagedEndpoint<PInputChannelThrottleQueueChild> aEndpoint,
            PInputChannelThrottleQueueChild* aActor);

    ManagedEndpoint<PAltServiceParent>
    OpenPAltServiceEndpoint(PAltServiceChild* aActor);
    bool
    BindPAltServiceEndpoint(
            ManagedEndpoint<PAltServiceChild> aEndpoint,
            PAltServiceChild* aActor);

    ManagedEndpoint<PAltSvcTransactionParent>
    OpenPAltSvcTransactionEndpoint(PAltSvcTransactionChild* aActor);
    bool
    BindPAltSvcTransactionEndpoint(
            ManagedEndpoint<PAltSvcTransactionChild> aEndpoint,
            PAltSvcTransactionChild* aActor);

    ManagedEndpoint<PTRRServiceParent>
    OpenPTRRServiceEndpoint(PTRRServiceChild* aActor);
    bool
    BindPTRRServiceEndpoint(
            ManagedEndpoint<PTRRServiceChild> aEndpoint,
            PTRRServiceChild* aActor);

    ManagedEndpoint<PProxyConfigLookupParent>
    OpenPProxyConfigLookupEndpoint(PProxyConfigLookupChild* aActor);
    bool
    BindPProxyConfigLookupEndpoint(
            ManagedEndpoint<PProxyConfigLookupChild> aEndpoint,
            PProxyConfigLookupChild* aActor);

    ManagedEndpoint<PNativeDNSResolverOverrideParent>
    OpenPNativeDNSResolverOverrideEndpoint(PNativeDNSResolverOverrideChild* aActor);
    bool
    BindPNativeDNSResolverOverrideEndpoint(
            ManagedEndpoint<PNativeDNSResolverOverrideChild> aEndpoint,
            PNativeDNSResolverOverrideChild* aActor);

