adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/_ipdlheaders/mozilla/net/PSocketProcessChild.h
    ManagedEndpoint<PRemoteLazyInputStreamParent>
    OpenPRemoteLazyInputStreamEndpoint(PRemoteLazyInputStreamChild* aActor);
    bool
    BindPRemoteLazyInputStreamEndpoint(
            ManagedEndpoint<PRemoteLazyInputStreamChild> aEndpoint,
            PRemoteLazyInputStreamChild* aActor);

    bool
    SendInitCrashReporter(const NativeThreadId& threadId);

    bool
    SendAddMemoryReport(const MemoryReport& aReport);

    bool
    SendAccumulateChildHistograms(const nsTArray<HistogramAccumulation>& accumulations);

    bool
    SendAccumulateChildKeyedHistograms(const nsTArray<KeyedHistogramAccumulation>& accumulations);

    bool
    SendUpdateChildScalars(const nsTArray<ScalarAction>& actions);

    bool
    SendUpdateChildKeyedScalars(const nsTArray<KeyedScalarAction>& actions);

    bool
    SendRecordChildEvents(const nsTArray<ChildEventData>& events);

    bool
    SendRecordDiscardedData(const DiscardedData& data);

    PWebrtcTCPSocketChild*
    SendPWebrtcTCPSocketConstructor(const mozilla::Maybe<TabId>& tabId);

    PWebrtcTCPSocketChild*
    SendPWebrtcTCPSocketConstructor(
            PWebrtcTCPSocketChild* actor,
            const mozilla::Maybe<TabId>& tabId);

    PChildToParentStreamChild*
    SendPChildToParentStreamConstructor();

    PChildToParentStreamChild*
    SendPChildToParentStreamConstructor(PChildToParentStreamChild* actor);

    bool
    SendObserveHttpActivity(
            const HttpActivityArgs& aActivityArgs,
            const uint32_t& aActivityType,
            const uint32_t& aActivitySubtype,
            const PRTime& aTimestamp,
            const uint64_t& aExtraSizeData,
            const nsCString& aExtraStringData);

    bool
    SendInitBackground(Endpoint<mozilla::ipc::PBackgroundParent>&& aEndpoint);

    PAltServiceChild*
    SendPAltServiceConstructor(PAltServiceChild* actor);

    bool
    SendGetTLSClientCert(
            const nsCString& aHostName,
            const OriginAttributes& aOriginAttributes,
            const int32_t& aPort,
            const uint32_t& aProviderFlags,
            const uint32_t& aProviderTlsFlags,
            const ByteArray& aServerCert,
            const mozilla::Maybe<ByteArray>& aClientCert,
            const nsTArray<ByteArray>& aCollectedCANames,
            bool* aSucceeded,
            ByteArray* aOutCert,
            ByteArray* aOutKey,
            nsTArray<ByteArray>* aBuiltChain);

    PProxyConfigLookupChild*
    SendPProxyConfigLookupConstructor(
            PProxyConfigLookupChild* actor,
            nsIURI* aUri,
            const uint32_t& aFlags);

    void
    SendCachePushCheck(
            nsIURI* aPushedURL,
            const OriginAttributes& aOriginAttributes,
            const nsCString& aRequestString,
            mozilla::ipc::ResolveCallback<bool>&& aResolve,
            mozilla::ipc::RejectCallback&& aReject);

    RefPtr<CachePushCheckPromise>
    SendCachePushCheck(
            nsIURI* aPushedURL,
            const OriginAttributes& aOriginAttributes,
            const nsCString& aRequestString);

    bool
    SendODoHServiceActivated(const bool& aActivated);

    PFileDescriptorSetChild*
    SendPFileDescriptorSetConstructor(const FileDescriptor& fd);

    PFileDescriptorSetChild*
    SendPFileDescriptorSetConstructor(
            PFileDescriptorSetChild* actor,
            const FileDescriptor& fd);

    PDNSRequestChild*
    SendPDNSRequestConstructor(
            PDNSRequestChild* actor,
            const nsCString& hostName,
            const nsCString& trrServer,
            const uint16_t& type,
            const OriginAttributes& originAttributes,
            const uint32_t& flags);

    void
    RemoveManagee(
            int32_t aProtocolId,
            IProtocol* aListener) override;
    void
    DeallocManagee(
            int32_t aProtocolId,
            IProtocol* aListener) override;

    Result
    OnMessageReceived(const Message& msg__) override;

    Result
    OnMessageReceived(
            const Message& msg__,
            Message*& reply__) override;

    Result
    OnCallReceived(
            const Message& msg__,
            Message*& reply__) override;

    void
    OnChannelClose() override;

    void
    OnChannelError() override;

private:
    void
    ClearSubtree();

    ManagedContainer<PDNSRequestChild> mManagedPDNSRequestChild;
    ManagedContainer<PWebrtcTCPSocketChild> mManagedPWebrtcTCPSocketChild;
    ManagedContainer<PFileDescriptorSetChild> mManagedPFileDescriptorSetChild;
    ManagedContainer<PHttpTransactionChild> mManagedPHttpTransactionChild;
    ManagedContainer<PHttpConnectionMgrChild> mManagedPHttpConnectionMgrChild;
    ManagedContainer<PChildToParentStreamChild> mManagedPChildToParentStreamChild;
    ManagedContainer<PParentToChildStreamChild> mManagedPParentToChildStreamChild;
    ManagedContainer<PInputChannelThrottleQueueChild> mManagedPInputChannelThrottleQueueChild;
    ManagedContainer<PAltServiceChild> mManagedPAltServiceChild;
    ManagedContainer<PAltSvcTransactionChild> mManagedPAltSvcTransactionChild;
    ManagedContainer<PTRRServiceChild> mManagedPTRRServiceChild;
    ManagedContainer<PProxyConfigLookupChild> mManagedPProxyConfigLookupChild;
    ManagedContainer<PNativeDNSResolverOverrideChild> mManagedPNativeDNSResolverOverrideChild;
    ManagedContainer<PRemoteLazyInputStreamChild> mManagedPRemoteLazyInputStreamChild;
};


} // namespace net
} // namespace mozilla
namespace mozilla {
namespace ipc {
template<>
struct IPDLParamTraits <mozilla::net::PSocketProcessChild*>
{
    typedef mozilla::net::PSocketProcessChild* paramType;
    static void
    Write(
            IPC::Message* aMsg,
            mozilla::ipc::IProtocol* aActor,
            const paramType& aVar);
    static bool
    Read(
            const IPC::Message* aMsg,
            PickleIterator* aIter,
            mozilla::ipc::IProtocol* aActor,
            paramType* aVar);
};
} // namespace ipc
} // namespace mozilla

#endif // ifndef PSocketProcessChild_h
